# Pandas - Operations

In [1]:
import numpy as np
import pandas as pd

In [22]:
# Generating Column List
col_list = [f"col{i}" for i in range(1, 5)]
col_list

['col1', 'col2', 'col3', 'col4']

In [38]:
df = pd.DataFrame(np.random.randn(30, 4), columns=col_list)
df

        col1      col2      col3      col4
0  -0.165440 -0.669507 -0.474255  0.198891
1  -1.172763  0.104658  1.002763 -2.675357
2   0.538675  0.762998 -0.418767 -0.544505
3  -0.834835  0.381963  1.488332  1.864129
4   2.080639  0.165276  0.530505 -0.853194
5   0.486596 -0.325489  0.980289 -1.212003
6  -0.224656 -0.609190 -0.446953  0.805024
7   0.776000 -0.098066  1.365273 -1.476231
8   0.594836 -0.907571  0.342863  0.174474
9  -0.067788 -0.843283  1.624158 -0.271260
10 -0.507784 -0.754337 -0.162997 -1.620459
11 -0.386363  0.146703  0.570091  0.436656
12  0.594375 -0.360168  0.190080 -0.592895
13  0.132568  1.117276 -0.010257  0.098464
14 -0.466808  0.676763  0.415334 -0.476553
15 -0.500989 -1.540290  2.584894  0.496985
16 -0.307160 -1.089593  1.066265 -0.265999
17  1.813440 -2.211346  2.308931  1.794203
18 -0.125735 -0.055188  0.925581  0.800345
19  1.638963 -0.198181  0.463356 -0.381218
20  1.166307  1.046126  1.567640 -0.510524
21 -1.779022 -0.470889  0.510014  1.072542
22 -0.229850  1.030622  0.097152  0.609778
23 -0.059067 -0.061258 -1.375390 -0.951610
24 -0.746749 -1.247056  0.622333  1.364644
25  0.042474 -0.669959 -0.098106  0.227643
26  0.291870  0.004229  0.412226 -1.359339
27  1.173157 -0.232404 -0.948187  0.714777
28  1.378364 -0.193334 -0.011510 -0.532319
29 -0.349505  0.156576  0.545622  0.848440

In [39]:
# Limit The Selection Of Data
# Returns Top 5 Rows
df.head()

       col1      col2      col3      col4
0 -0.165440 -0.669507 -0.474255  0.198891
1 -1.172763  0.104658  1.002763 -2.675357
2  0.538675  0.762998 -0.418767 -0.544505
3 -0.834835  0.381963  1.488332  1.864129
4  2.080639  0.165276  0.530505 -0.853194

In [40]:
# Return Specified Number of Top Most Rows
df.head(7)

       col1      col2      col3      col4
0 -0.165440 -0.669507 -0.474255  0.198891
1 -1.172763  0.104658  1.002763 -2.675357
2  0.538675  0.762998 -0.418767 -0.544505
3 -0.834835  0.381963  1.488332  1.864129
4  2.080639  0.165276  0.530505 -0.853194
5  0.486596 -0.325489  0.980289 -1.212003
6 -0.224656 -0.609190 -0.446953  0.805024

In [41]:
# Returns Bottom 5 Rows
df.tail()

        col1      col2      col3      col4
25  0.042474 -0.669959 -0.098106  0.227643
26  0.291870  0.004229  0.412226 -1.359339
27  1.173157 -0.232404 -0.948187  0.714777
28  1.378364 -0.193334 -0.011510 -0.532319
29 -0.349505  0.156576  0.545622  0.848440

In [42]:
# Return Specified Number of Bottom Most Rows
df.tail(8)

        col1      col2      col3      col4
22 -0.229850  1.030622  0.097152  0.609778
23 -0.059067 -0.061258 -1.375390 -0.951610
24 -0.746749 -1.247056  0.622333  1.364644
25  0.042474 -0.669959 -0.098106  0.227643
26  0.291870  0.004229  0.412226 -1.359339
27  1.173157 -0.232404 -0.948187  0.714777
28  1.378364 -0.193334 -0.011510 -0.532319
29 -0.349505  0.156576  0.545622  0.848440

In [45]:
df2 = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [51]:
# Selecting Unique Values of a Column
df2['col2'].unique()

array([444, 555, 666], dtype=int64)

In [52]:
len(df2['col2'].unique())

3

In [56]:
# But Pandas Has Built-In Function To Get The Length Of Unique Values in a row
df2['col2'].nunique()

3

In [59]:
# Returns How Many Times a Unique Value Is Occrued Inside A Column
df2['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Conditional Selection

In [62]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [64]:
df2[df2['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [65]:
df2[(df2['col1'] > 2) | (df2['col2'] == 444) ]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

### Apply Function

In [67]:
def times2(x):
    return x * 2

In [69]:
# We Can Use Built In Function On A Column But With The Help of Apply Function We Can also use custom function with DataFrame Columns
df2['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [70]:
df2['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [72]:
# Can Also Apply Built-In Function
df2['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [75]:
# Using Lamda With Apply
df2['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [77]:
df2['col3'].apply(lambda x: x * 2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

### Removing Columns

In [79]:
df2.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [81]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Some Important Methods & Attributes

In [83]:
# Returns All The Column Names
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [85]:
# Returns The Range Information of Index of a DataFrame
df.index

RangeIndex(start=0, stop=30, step=1)

In [87]:
# Sorting Values
df2.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
# To Check Where We Have NaN Values
df2.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Pivot Table

In [91]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [93]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [94]:
df.pivot_table(values='D', index=['A'], columns=['C', 'B'])

C      x         y
B    one  two  one  two
A
bar  4.0  NaN  1.0  5.0
foo  1.0  2.0  3.0  NaN